{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "Hello",
                "Good morning",
                "Good evening",
                "ሰላም",
                "እንዴት ነህ?",
                "እንኳን ደህና መጡ",
                "Yo",
                "Howdy"
            ],
            "responses": [
                "Hello 👋 I’m TheISSeer — ask me anything about your department!",
                "Selam! Need help with your IS department today?",
                "Hi there! Ready to navigate Information Science together?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "Goodbye",
                "See you",
                "ቻው",
                "ደህና ሁን",
                "Catch you later",
                "See ya"
            ],
            "responses": [
                "Take care! Come back anytime. 🎓",
                "It was great assisting you. 👋",
                "Logging off now, stay curious!"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "Thanks a lot",
                "አመሰግናለሁ",
                "ምስጋና",
                "Appreciate it",
                "I’m grateful"
            ],
            "responses": [
                "You're most welcome!",
                "Anytime! 😎",
                "Glad to be of help!"
            ]
        },
        {
            "tag": "bot_creator",
            "patterns": [
                "Who made this bot?",
                "Who is the creator?",
                "Who made you?",
                "Who is your developer?",
                "who built you?",
                "Who created you?",
                "Who is your GOD",
                "ይህን አዘጋጀው ማን ነው?",
                "Who built you?"
            ],
            "responses": [
                                "I was built by a fellow student, officially supported by the department!",
                "Student-built. Department-acknowledged. Created with purpose. 🔧",
                "The ISSeer made me! I’m here to help you navigate your academic journey. 💻",
                "I was created by a student, with the support of a friend. 👍"
            ]
        },
        {
            "tag": "bot_purpose",
            "patterns": [
                "What can you do?",
                "What's your purpose?",
                "What are you",
                "What can you do",
                "የአንተ ስራ ምንድነው?",
                "How do you help students?",
                "What’s your job?"
            ],
            "responses": [
                "I help with info about your department, instructors, and redirect you to great study resources. Ask away!",
                "Ask about instructors, offices, contacts or how to access learning content.",
                "I’m your academic navigator — no file sharing, but 100% clarity!"
            ]
        },
        {
            "tag": "instructor_info",
            "patterns": [
                "Who are the instructors?",
                "List of instructors",
                "Instructors",
                "ምን ይላል አስተዳደር",
                "የአስተዳደር መምህራን",
                "Who teaches this course?",
                "የአስተዳደር መምህራን ማነው?",
                "የአስተዳደር መምህራን የሚያውቁት ማነው?",
                "Who are the professors?",
                "Who is the lecturer?",
                "የአስተዳደር መምህራን የሚያውቁት ማነው?",
                "Who is the instructor?",
                "Who is the teacher?",
                "Teachers list",
                "የአስተዳደር መምህራን የሚያውቁት ማነው?"
            ],
            "responses": [
                "You can view all instructors, emails, roles, and offices in the Academic Navigator 📘",
                "Dr. Michael Melese is the Department Head — Office: Eshetu Chole 621",
                "Search instructors by name or course via the bot navigator. 🧑‍🏫"
            ]
        },
        {
            "tag": "telegram_redirect",
            "patterns": [
                "Do you have notes?",
                "Where can I download exams?",
                "ማስታወሻ አለ?",
                "slides",
                "ማስተላለፊያ",
                "Can you send PDFs?",
                "Files?"
            ],
            "responses": [
                "Download all course files, notes, and exams from our free Telegram bot 👉 @SISResourcesBot",
                "TheISSeer doesn’t send files — for that, join the Telegram bot 📚",
                "I help with info and clarity. For files, please use @SISResourcesBot!"
            ]
        },
        {
    
                "tag": "Ambassador",
                "patterns": [
                    "Who is the most opportunity grabbing person in IS department?",
                    "Oportunity grab","Jack of all trades","Jack of all trades and master of all","Competent WomenTech maker"
                ],
            "responses": [
                "Eden is the most talented IS Student. She works hard, she is competent, she is funny and also She is the best that IS could offer."
            ]
        },
        {
            "tag": "Sewasew",
            "patterns": [
                "Sewasew",
                "Tell me about Sewasew",
                "Who is Sewasew?",
                "Who is Sewasew ",
                "Sewasew the IS students mom"]
                ,

                "responses": [
                 "Sewasew made the ISSeer not the bot!"
                ]
              },
              {
                "tag": "office_hours",
                "patterns": [
                  "When is Dr. Brook available?",
                  "Office hours for instructors",
                  "Advisor schedule",
                  "Meeting time for lecturers",
                  "When can I visit my advisor?"
                ],
                "responses": [
                  "You can find faculty office hours posted on the SIS notice board or through the Academic Navigator.",
                  "Ask about a specific instructor — I might have their schedule!"
                ]
              },
              {
                "tag": "course_prerequisite",
                "patterns": [
                  "Prerequisites for Software Engineering?",
                  "Do I need OOP before AI?",
                  "Which course comes before DBMS?",
                  "Pre-req for Data Structures"
                ],
                "responses": [
                  "SIS courses usually follow a set structure. I can help you check the prerequisites based on the curriculum flowchart.",
                  "Let me know the course name and I’ll check if there’s a required class before it."
                ]
              },
              {
                "tag": "course_outline",
                "patterns": [
                  "Syllabus for Networking",
                  "Course topics in AI",
                  "What’s covered in DBMS?",
                  "Outline for Data Structures",
                  "Modules in Software Engineering"
                ],
                "responses": [
                  "Most outlines are shared via your instructors or @SISResourcesBot. I can check it for you!",
                  "Let me know the course code (e.g., ISCI 3013) and I’ll help you find the syllabus."
                ]
              },
              
          
              {
                "tag": "motivation",
                "patterns": [
                  "I’m tired of studying",
                  "Motivate me please",
                  "SIS is hard 😩",
                  "Can you encourage me?",
                  "I need inspiration"
                ],
                "responses": [
                  "You’re a student at AAU’s School of Information Science — you already made it far!",
                  "Your future self will thank you. Keep pushing, one line of code at a time!"
                ]
              },
                          {
              "tag": "IS_department_info",
              "patterns": [
                "Tell me about the IS department",
                "Information Systems at AAU",
                "What is the School of Information Systems?",
                "Where is the IS department located?",
                "Info about Information Systems program",
                "IS program details",
                "Contact IS department",
                "What is taught in IS at AAU?",
                "Overview of IS department",
                "Information Systems Addis Ababa University"
              ],
              "responses": [
                "👋 Hello! Welcome to the Addis Ababa University School of Information Systems! 😊\n\nThe School of Information Systems, part of the College of Natural Sciences, offers a vibrant 4-year Bachelor of Information Systems (BIS) program. We're located on the FBE Campus, offering a blend of technical and managerial skills training.\n\n📚 *Curriculum Highlights*: Our BIS program covers a wide range of topics, from programming (C++, Java, web development) and databases to system analysis, design, and cybersecurity. You can find detailed course info including credit hours in our course catalog (available on request).\n\n👨‍🏫 *Faculty*: We have a dedicated team of instructors. You can find their office locations, emails, and LinkedIn profiles in our Instructor Directory.\n\n🎉 *Events & Community*: We host regular events like hackathons, IS Day, workshops, game fests, and IS Talks—perfect for networking, learning, and fun!\n\n🏢 *Location & Contact*: The department office is on the 1st floor of the Eshetu Chole Building, FBE Campus. Phone: 011 122 9191.\n\nFeel free to ask anything else! 😊"
              ]
            },
              {
                "tag": "IS_Student",
                "patterns": [
                  "Tell me about IS students",
                  "Who are the IS students?",
                  "What do you know about IS students?",
                  "IS students at AAU",
                  "Do you know any IS students?",
                  "IS students from Section 3",
                  "Talk about IS students",
                  "Describe IS students",
                  "Facts about IS students"
                ],
                "responses": [
                  "The best people, the best doctors, the best sisters. Nobody is like them!"
                ]
              },
              {
                "tag": "IS_students",
                "patterns": [
                  "Tell me about IS students",
                  "Who are the IS students?",
                  "Describe the Information Systems students",
                  "What are IS students like?",
                  "IS student life",
                  "IS students AAU",
                  "Information Systems students profile",
                  "How are the students in IS?",
                  "What do IS students do?",
                  "Do IS students code?"
                ],
                "responses": [
                  "Information Systems (IS) students at Addis Ababa University are known for their interdisciplinary skills, blending tech with business insight. 💡 Many are talented in coding, design, and data analysis, while also excelling in project management and communication. \n\nThey actively participate in community events like hackathons, workshops, IS Day, and IS Talks 🎉. They're also involved in clubs like GDSC AAU and contribute to real-world projects, startups, and competitions. \n\nIS students come from diverse backgrounds but share a common passion for solving problems using technology and information systems. They're creative, collaborative, and constantly pushing boundaries! 🚀"
                ]
              },                          
            {
                "tag": "Docye",
                "patterns": [
                  "Docye",
                  "Tell me about Docye",
                  "Who is Docye?",
                  "What do you know about Docye?",
                  "Docye the IS student",
                  "Do you know Docye?",
                  "Docye from Section 3",
                  "Docye, who is she?",
                  "Talk about Docye",
                  "Describe Docye",
                  "Facts about Docye"
                ],
                "responses": [
                  "The best person, the best Doctor, the best sister. Nobody is like her!"
                ]
              },  {
                "tag": "IS_department_features",
                "patterns": [
                  "What makes the IS department special?",
                  "Why is the Information Systems program unique?",
                  "Tell me the best features of the IS program",
                  "Why should I study IS at AAU?",
                  "IS vs CS at AAU",
                  "Special aspects of Information Systems department"
                ],
                "responses": [
                  "📍 The Information Systems (IS) program at Addis Ababa University stands out for its powerful integration of both technical and managerial skills. Unlike purely technical Computer Science programs, our BIS curriculum blends business principles, management theories, and socio-cultural insights with programming and IT infrastructure training. 🖥️📊 This holistic education prepares students to be system designers, analysts, project managers, and tech-savvy entrepreneurs ready for multidisciplinary careers."
                ]
              },
              {
                "tag": "IS_students_uniqueness",
                "patterns": [
                  "What makes IS students unique?",
                  "Why are IS students at AAU special?",
                  "Describe the uniqueness of IS students",
                  "IS student skills",
                  "How do IS students stand out?"
                ],
                "responses": [
                  "💡 IS students at AAU are uniquely equipped with both technical and managerial expertise. Through programming, database systems, and networking courses, they gain strong technical foundations. But they also take classes in Entrepreneurship, Management, and Accounting, building essential business skills. \n\nTheir experiences go beyond the classroom with hands-on activities like hackathons, IS Talks, and collaborative projects. The focus on emerging technologies like AI and IoT, paired with ethics and societal relevance, makes them versatile innovators ready for the future."
                ]
              },
              {
                "tag": "IS_course_overview",
                "patterns": [
                  "Can I get a summary of IS courses?",
                  "What are the IS courses like?",
                  "Tell me about the IS program structure",
                  "Give me a course overview for Information Systems",
                  "IS degree roadmap"
                ],
                "responses": [
                  "🗂️ The Bachelor of Information Systems (BIS) program at AAU is a comprehensive 4-year journey:\n\n📘 **1st Year:** Core courses like Communicative English, Programming in C++, Applied Math, and Emerging Technologies.\n\n📗 **2nd Year:** Students dive deeper into Management, Discrete Math, Accounting, Object-Oriented Programming, and Databases.\n\n📙 **3rd Year:** Includes Internet Programming, Research Methods, System Analysis & Design, and Networking.\n\n📕 **4th Year:** Advanced topics such as AI, HCI, Project Management, Data Science, Enterprise Systems, and inclusivity in tech.\n\n📌 For a full and official list, refer to the AAU IS course catalog!"
                ]
              },                          
              {
                "tag": "IS_Talks",
                "patterns": [
                  "the best episode IS_talks",
                  "the episode with team roha",
                  "IS_talks show",
                  "What is IS_talks?",
                  "Tell me about IS_talks"
                ],
                "responses": [
                  "The IS_Talks is a student-led talk series from the School of Information Science at Addis Ababa University, highlighting innovative minds and their journeys. You can watch one of the best episodes featuring Team Roha here: https://www.youtube.com/watch?v=DedNu9pTV3E&t=3187s"
                ]
              },
              {
                "tag": "team_roha",
                "patterns": [
                  "Team roha",  
                  "Team Roha",
                  "who are team roha?",
                  "Tell me about Team Roha",
                  "Team Roha members",
                  "Team Roha in the hackathon",
                  "IS hackathon team Roha"
                ],
                "responses": [
                  "Team Roha is made up of 4 Information Systems students — Berhanelidet Bekele, Edeal, Abel, and Shahon — and 1 Computer Science student, Nolawi Assefa. 🎉 Congratulations to Team Roha from Information Systems for securing 2nd place in the Google Developers Club AAU Hackathon! 🏆 Your hard work and dedication have truly paid off, and this achievement is just the beginning. We look forward to seeing even greater accomplishments from you in the future. Keep pushing the boundaries and continue working with the same passion and drive!"
                ]
              }
,              
        {
            "tag": "joke",
            "patterns": [
                "Tell me a joke",
                "አንድ ቀልድ ንገረኝ",
                "Something funny"
            ],
            "responses": [
                "😂 Why did the programmer quit his job? Because he didn’t get arrays!",
                "ለምን ፒሲው በጋባ ምርምር አደረገ? የእርሱ ፊውትራ ነበር!",
                "Why don’t programmers like nature? It has too many bugs.",
                "Why was the computer cold? It left its Windows open!",
                "Why do programmers prefer dark mode? Because light attracts bugs!",
                "Why did the computer go to therapy? It had too many bytes of emotional baggage!"
            ]
        },
        {
            "tag": "fallback",
            "patterns": [
                "....",
                "??",
                "I don't know",
                "Invalid query",
                "What?"
            ],
            "responses": [
                "Sorry, I didn’t catch that. Could you rephrase it?",
                "Hmm, that’s not something I understand yet.",
                "Please try asking about instructors, resources, or IS topics."
            ]
        },
       
        {
            "tag": "department_history",
            "patterns": [
                "What is the history of the department?",
                "Tell me about the department's history",
                "Department background",
                "How did this department start?"
            ],
            "responses": [
                "The Information Science department was established in 2000 to address the growing need for information professionals."
            ]
        },
        {
            "tag": "department_mission",
            "patterns": [
                "What is the mission of the department?",
                "Department mission statement",
                "What does the department aim to achieve?",
                "Department goals"
            ],
            "responses": [
                "The mission of the Information Science department is to educate and train professionals in the field of information management."
            ]
        },
        {
            "tag": "department_vision",
            "patterns": [
                "What is the vision of the department?",
                "Department vision statement",
                "What does the department aspire to be?",
                "Department future goals"
            ],
            "responses": [
                "The vision of the Information Science department is to be a leader in information education and research in Africa."
            ]
        },
        {
            "tag": "department_values",
            "patterns": [
                "What are the values of the department?",
                "Department core values",
                "What does the department believe in?",
                "Department principles"
            ],
            "responses": [
                "The Information Science department values integrity, innovation, collaboration, and excellence in education."
            ]
        },
        {
            "tag": "department_contact",
            "patterns": [
                "How can I contact the department?",
                "Department contact information",
                "Is there a phone number?",
                "Can I email someone?"
            ],
            "responses": [
                "You can reach us at: @TheISSeer or @Berhanbek:"
            ]
        },
       
        {
            "tag": "office_location",
            "patterns": [
                "Where is the department office?",
                "What is your location?",
                "Where can I find the department?",
                "Department building location?",
                "How can I contact the department?",
                "Is there a phone number?",
                "Can I email someone?",
                "Contact information?"
            ],
            "responses": [
                "📍 Location: Eshetu Chole Building, FBE Campus — 1st Floor\n ☎️ Phone Number: 011 122 9191\n 📧 Email: information_sci_cns@aau.edu.et"
            ]
        },
        {
            "tag": "department_activities",
            "patterns": [
                "What events are happening?",
                "Are there any workshops?",
                "Do you have seminars?",
                "What activities are planned?"
            ],
            "responses": [
                "We host workshops, seminars, and guest lectures throughout the semester. Stay tuned!"
            ]
        },
        {
            "tag": "department_website",
            "patterns": [
                "What is the department website?",
                "Where can I find more info online?",
                "Is there a website for the department?",
                "Department online resources?"
            ],
            "responses": [
                "You can visit our official website at [www.aau.edu.et](http://www.aau.edu.et) for more information."
            ]
        },
        {
            "tag": "club_activities",
            "patterns": [
                "Are there student clubs?",
                "What student activities are there?",
                "Do you have extracurriculars?",
                "Are there any events in the department?"
            ],
            "responses": [
                "Yes! We have coding clubs, research groups, hackathons, and seminars every semester."
            ]
        },
        {
            "tag": "department_head",
            "patterns": [
                "Head",
                "Department head",
                "Leader",
                "Department leader",
                "Who is the head of the department?",
                "Department head?",
                "IS department head",
                "Who leads the Information Science department?",
                "ራስ መምህሩ ማን ነው?"
            ],
            "responses": [
                "👨‍🏫 Dr. Michael Melese Woldeyohannis is the current Department Head of the School of Information Science at Addis Ababa University.",
                "The department is led by Dr. Michael Melese. Office: Eshetu Chole 621. Email: michael.melese@aau.edu.et"
            ]
        },
      
        {
            "tag": "academic_calendar",
            "patterns": [
                "What is the calander",
                "Academic Calander",
                "Calander Schedule",
                "How is the semester arranged?",
                "Academic calendar",
                "የሰሜስተሩ ቅደም ተከተል",
                "When do we start classes?",
                "When is mid exam?",
                "When is final exam?",
                "የመካከለኛ ፈተና ጊዜ?",
                "ክፍል መጀመሪያ መቼ ነው?"
            ],
            "responses": [
                "📆 **Academic Calendar Overview:**\n🟢 *1st Semester (October – January)*\n- Classes begin early October\n- Mid Exams around mid-November\n- Final Exams late January\n\n🔵 *2nd Semester (February – June)*\n- Classes resume mid-February\n- Mid Exams usually in April\n- Final Exams early to mid-June\n\n🛎️ *Note:* Dates may shift slightly each year. Always check official announcements or your class advisor!"
            ]
        },
        {
            "tag": "study_resources",
            "patterns": [
                "Where can I find study materials?",
                "Are there online resources?",
                "Where can I download notes?",
                "Study guides available?"
            ],
            "responses": [
                "You can find study materials on our Telegram channel @SISResourcesBot or through the department website."
            ]
        },
        {
            "tag": "default",
            "patterns": [],
            "responses": [
                "I do not understand... Try asking something else about the department."
            ]
        }
    ]
}